{
  "personal_info": {
    "name": "Dheeraj Chand",
    "phone": "202.550.7110",
    "email": "dheeraj.chand@gmail.com",
    "website": "https://www.dheerajchand.com",
    "linkedin": "https://www.linkedin.com/in/dheerajchand/"
  },
  "summary": "Strategic data and technology consultant with 21 years solving complex problems through analytics and software development. Specializes in transforming organizational data capabilities from concept to production. Expert in translating business requirements into technical solutions, with proven success across political, nonprofit, and technology sectors. Currently building scalable data platforms while modernizing legacy systems for improved performance and maintainability.",
  "competencies": {
    "Consulting Expertise": [
      "Strategic Data Analysis (Exploratory, Predictive, Explanatory)",
      "Data Engineering and Infrastructure Development",
      "Systems Integration and Architecture Consulting",
      "Project Management and Product Management",
      "Team Leadership and Technical Mentoring",
      "Stakeholder Communication and Requirements Gathering"
    ],
    "Technical Solutions": [
      "Programming: Python (Django, Pandas, PySpark), Scala (Spark), JavaScript",
      "Data Platforms: PostgreSQL/PostGIS, Snowflake, MongoDB, AWS, GCP",
      "Analytics: Tableau, PowerBI, Statistical Modeling, Machine Learning",
      "Integration: APIs, ETL/ELT pipelines, Cloud migrations, Legacy modernization"
    ],
    "Industry Focus": [
      "Political and Electoral Data Analytics",
      "Nonprofit and Community Organization Solutions",
      "Technology Startup and Scale-up Consulting",
      "Geospatial Analysis and Demographic Intelligence",
      "Survey Research and Consumer Behavior Analysis"
    ]
  },
  "experience": [
    {
      "title": "PRINCIPAL CONSULTANT",
      "company": "Your Company Name, Your City, ST",
      "dates": "2005 – Present",
      "subtitle": "Data, Technology and Strategy Consulting",
      "responsibilities": [
        "Provide comprehensive data analysis, engineering, and strategic planning for diverse client portfolio",
        "Develop custom software solutions and data pipeline architectures for complex integration requirements",
        "Lead digital transformation initiatives including cloud migrations and legacy system modernization",
        "Deliver management consulting including project planning, team building, and operational optimization",
        "Maintain long-term strategic partnerships with clients across political, nonprofit, and technology sectors"
      ]
    }
  ],
  "achievements": {
    "Technology Innovation": [
      "Developed proprietary B2B SaaS solutions for data analytics and geospatial applications",
      "Created open source frameworks for political and social behavior prediction",
      "Pioneered integration of advanced mapping techniques into standard consulting deliverables"
    ]
  },
  "_metadata": {
    "version": "consulting_minimal",
    "user": "Dheeraj Chand",
    "created": "2025-05-27T17:11:24.267765",
    "description": "Minimal consulting-focused version emphasizing strategic advisory and technical expertise"
  }
}