{
  "personal_info": {
    "name": "Dheeraj Chand",
    "phone": "202.550.7110",
    "email": "dheeraj.chand@gmail.com",
    "website": "https://www.dheerajchand.com",
    "linkedin": "https://www.linkedin.com/in/dheerajchand/"
  },
  "summary": "Research & Data Professional with 21 years of comprehensive experience spanning applied research, data engineering, and software development. Expert in translating complex analytical requirements into scalable technical solutions. Proven track record leading cross-functional teams, architecting data platforms, and delivering insights that drive strategic decision-making across political, nonprofit, and technology sectors. Deep expertise in survey methodology, geospatial analysis, and building production systems for sensitive data applications.",
  "competencies": {
    "Research and Analytics": [
      "Survey Methodology: Design, sampling, weighting, longitudinal analysis",
      "Statistical Analysis: Regression modeling, clustering, segmentation, machine learning",
      "Geospatial Analysis: Spatial clustering, boundary estimation, demographic mapping",
      "Data Visualization: Tableau, PowerBI, d3.js, Matplotlib, Seaborn, choropleth mapping",
      "Research Management: Team leadership, methodology design, stakeholder communication"
    ],
    "Programming and Development": [
      "Python: Django/GeoDjango, Flask, Pandas, PySpark, SciKit-Learn, TensorFlow",
      "JVM Languages: Scala (Spark), Java, Groovy",
      "Web Technologies: JavaScript, React, d3.js, PHP, HTML/CSS",
      "Database Languages: SQL, T-SQL, PostgreSQL/PostGIS",
      "Statistical Computing: R, SPSS, SAS, Stata"
    ],
    "Data Infrastructure": [
      "Cloud Platforms: AWS (EC2, RDS, S3), Google Cloud Platform, Microsoft Azure",
      "Big Data: Apache Spark, PySpark, Hadoop, Snowflake, dbt",
      "Databases: PostgreSQL/PostGIS, MySQL, Oracle, MongoDB, Neo4j",
      "Geospatial: ESRI ArcGIS, Quantum GIS, GeoServer, OSGeo, GRASS",
      "DevOps: Docker, Git, CI/CD pipelines, automated testing, version control"
    ]
  },
  "experience": [
    {
      "title": "PARTNER",
      "company": "Your Company Name, Your City, ST",
      "dates": "2005 – Present",
      "subtitle": "Data, Technology and Strategy Consulting",
      "responsibilities": [
        "Conduct comprehensive quantitative and qualitative research studies for political candidates and organizations",
        "Architect cloud-based data warehouse solutions processing billions of records for electoral analytics",
        "Design scalable ETL pipelines using PySpark and dbt for large-scale geospatial and demographic datasets",
        "Develop custom analytical tools and algorithms for fraud detection and spatial clustering",
        "Manage complex client relationships across political, nonprofit, and technology sectors",
        "Lead technical architecture decisions for data-intensive applications and platforms"
      ]
    }
  ],
  "achievements": {
    "Software Development and Innovation": [
      "Conceived and deployed redistricting software used by thousands of analysts nationwide",
      "Developed boundary estimation system using incomplete data without ML requirements",
      "Created econometric simulation platform for humanitarian intervention modeling",
      "Built comprehensive survey operations platform from RFP through deployment"
    ]
  },
  "_metadata": {
    "version": "comprehensive_full",
    "user": "Dheeraj Chand",
    "created": "2025-05-27T17:11:24.267508",
    "description": "Comprehensive version with complete work history and technical depth"
  }
}